Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (CircleRebarGroup, Line)
 Splits the circle rebar group and creates a new one in the given position.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static CircleRebarGroup Split(
	CircleRebarGroup Object,
	Line SplitLine
)
Public Shared Function Split (
	Object As CircleRebarGroup,
	SplitLine As Line
) As CircleRebarGroup
Parameters
Object
Type: Tekla.Structures.Model.CircleRebarGroup
The circle rebar group object to be splitted.
SplitLine
Type: Tekla.Structures.Geometry3d.Line
The line where splitting is executed.
Return Value
Type: CircleRebarGroup
The created circle rebar group on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace